In [1]:
import pandas as pd

In [4]:
dados = pd.read_csv('tb_mesa.csv')

In [5]:
dados.info

<bound method DataFrame.info of      codigo_mesa  id_cliente  num_pessoa_mesa    data_hora_entrada  \
0              1          70               18  2023-01-29 03:16:24
1              2          35               13  2024-03-24 03:11:10
2              3          46               11  2022-10-19 05:52:38
3              4          46               15  2023-10-30 19:33:55
4              5          18                7  2023-11-16 13:37:16
..           ...         ...              ...                  ...
995          996          70                4  2023-09-27 14:27:30
996          997          35               11  2022-10-29 21:57:29
997          998          55               14  2023-06-22 08:53:01
998          999          62                6  2024-01-22 13:36:15
999         1000          72                2  2023-06-22 12:28:42

         data_hora_saida
0    2023-01-30 17:16:24
1    2024-03-27 00:11:10
2    2022-10-20 02:52:38
3    2023-10-31 22:33:55
4    2023-11-19 01:37:16
..                   ...
995  2023-09-28 22:27:30
996  2022-11-01 00:57:29
997  2023-06-23 20:53:01
998  2024-01-22 23:36:15
999  2023-06-26 07:28:42

[1000 rows x 5 columns]>

In [6]:
dados.drop('id_cliente', axis = 1, inplace=True)

In [7]:
dados.info

<bound method DataFrame.info of      codigo_mesa  num_pessoa_mesa    data_hora_entrada      data_hora_saida
0              1               18  2023-01-29 03:16:24  2023-01-30 17:16:24
1              2               13  2024-03-24 03:11:10  2024-03-27 00:11:10
2              3               11  2022-10-19 05:52:38  2022-10-20 02:52:38
3              4               15  2023-10-30 19:33:55  2023-10-31 22:33:55
4              5                7  2023-11-16 13:37:16  2023-11-19 01:37:16
..           ...              ...                  ...                  ...
995          996                4  2023-09-27 14:27:30  2023-09-28 22:27:30
996          997               11  2022-10-29 21:57:29  2022-11-01 00:57:29
997          998               14  2023-06-22 08:53:01  2023-06-23 20:53:01
998          999                6  2024-01-22 13:36:15  2024-01-22 23:36:15
999         1000                2  2023-06-22 12:28:42  2023-06-26 07:28:42

[1000 rows x 4 columns]>

In [8]:
dados.drop('data_hora_entrada', axis = 1, inplace=True)

In [9]:
dados.drop('data_hora_saida', axis = 1, inplace=True)

In [10]:
dados.info

<bound method DataFrame.info of      codigo_mesa  num_pessoa_mesa
0              1               18
1              2               13
2              3               11
3              4               15
4              5                7
..           ...              ...
995          996                4
996          997               11
997          998               14
998          999                6
999         1000                2

[1000 rows x 2 columns]>

In [11]:
dados.isna().any()

codigo_mesa        False
num_pessoa_mesa    False
dtype: bool

In [12]:
dados.to_csv('tb_mesa_alterados.csv')

In [13]:
dados.isna().any()

codigo_mesa        False
num_pessoa_mesa    False
dtype: bool

In [14]:
pd.concat

<function pandas.core.reshape.concat.concat(objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]', axis: 'Axis' = 0, join: 'str' = 'outer', ignore_index: 'bool' = False, keys=None, levels=None, names=None, verify_integrity: 'bool' = False, sort: 'bool' = False, copy: 'bool' = True) -> 'DataFrame | Series'>

In [15]:
df.dropna(axis=1, how='all')

NameError: name 'df' is not defined

In [16]:
df.tb_mesa_alterados.csv(axis=1, how='all')

NameError: name 'df' is not defined

In [17]:
df.clean

NameError: name 'df' is not defined

In [18]:
dados.info

<bound method DataFrame.info of      codigo_mesa  num_pessoa_mesa
0              1               18
1              2               13
2              3               11
3              4               15
4              5                7
..           ...              ...
995          996                4
996          997               11
997          998               14
998          999                6
999         1000                2

[1000 rows x 2 columns]>

In [19]:
df_cleaned = df.dropna()

NameError: name 'df' is not defined

In [20]:
df_cleaned = df.dropna(axis=1)

NameError: name 'df' is not defined

In [21]:
df = pd.read_csv('tb_mesa_alterados.csv')

In [22]:
df_cleaned = df.dropna()

In [23]:
df_cleaned.head()

   Unnamed: 0  codigo_mesa  num_pessoa_mesa
0           0            1               18
1           1            2               13
2           2            3               11
3           3            4               15
4           4            5                7

In [24]:
dados.to_csv('tb_mesa_alterados.csv')

In [25]:
df.dropna(axis=1, how='all')

     Unnamed: 0  codigo_mesa  num_pessoa_mesa
0             0            1               18
1             1            2               13
2             2            3               11
3             3            4               15
4             4            5                7
..          ...          ...              ...
995         995          996                4
996         996          997               11
997         997          998               14
998         998          999                6
999         999         1000                2

[1000 rows x 3 columns]

In [26]:
df.dropna(axis=1, how='any')

     Unnamed: 0  codigo_mesa  num_pessoa_mesa
0             0            1               18
1             1            2               13
2             2            3               11
3             3            4               15
4             4            5                7
..          ...          ...              ...
995         995          996                4
996         996          997               11
997         997          998               14
998         998          999                6
999         999         1000                2

[1000 rows x 3 columns]

In [27]:
df.dropna(axis=0, how='all')

     Unnamed: 0  codigo_mesa  num_pessoa_mesa
0             0            1               18
1             1            2               13
2             2            3               11
3             3            4               15
4             4            5                7
..          ...          ...              ...
995         995          996                4
996         996          997               11
997         997          998               14
998         998          999                6
999         999         1000                2

[1000 rows x 3 columns]

In [28]:
df.dropna(thresh=2)

     Unnamed: 0  codigo_mesa  num_pessoa_mesa
0             0            1               18
1             1            2               13
2             2            3               11
3             3            4               15
4             4            5                7
..          ...          ...              ...
995         995          996                4
996         996          997               11
997         997          998               14
998         998          999                6
999         999         1000                2

[1000 rows x 3 columns]

In [30]:
dados.to_csv('tb_mesa_alterados.csv')

In [31]:
dados.to_csv('tb_mesa_alterados.csv')

In [32]:
dados.info

<bound method DataFrame.info of      codigo_mesa  num_pessoa_mesa
0              1               18
1              2               13
2              3               11
3              4               15
4              5                7
..           ...              ...
995          996                4
996          997               11
997          998               14
998          999                6
999         1000                2

[1000 rows x 2 columns]>